tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "exa"
brew "gh"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "jq"
brew "lazygit"
brew "macvim"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "pnpm"
brew "python@3.11"
brew "ripgrep"
brew "tmux"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "alacritty"
cask "android-platform-tools"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "firefox-developer-edition"
cask "font-jetbrains-mono-nerd-font"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "orion"
cask "parallels"
cask "postman"
cask "raycast"
cask "sf-symbols"
cask "shottr"
cask "spotify"
cask "stats"
cask "teamviewer"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "ardenivanov.svelte-intellisense"
vscode "ArjunUmathanu.monokai-dark-pro"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "ckolkman.vscode-postgres"
vscode "codingyu.laravel-goto-view"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-redis-client"
vscode "Davidsekar.redis-xplorer"
vscode "dbaeumer.vscode-eslint"
vscode "DEVSENSE.composer-php-vscode"
vscode "DEVSENSE.intelli-php-vscode"
vscode "DEVSENSE.phptools-vscode"
vscode "DEVSENSE.profiler-php-vscode"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "IBM.output-colorizer"
vscode "IHunte.laravel-blade-wrapper"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "junstyle.php-cs-fixer"
vscode "kokororin.vscode-phpfmt"
vscode "kreativ-software.csharpextensions"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "naoray.laravel-goto-components"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "patbenatar.advanced-new-file"
vscode "patcx.vscode-nuget-gallery"
vscode "pgl.laravel-jump-controller"
vscode "PKief.material-icon-theme"
vscode "Pool.redisexplorer"
vscode "Prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rubenverg.bootstrap-product-icons"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "shufo.vscode-blade-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "twxs.cmake"
vscode "uniquevision.vscode-plpgsql-lsp"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "VSpaceCode.whichkey"
vscode "waderyan.gitblame"
vscode "WallabyJs.quokka-vscode"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "YoavBls.pretty-ts-errors"
vscode "zobo.php-intellisense"
