tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "dotnet"
brew "exa"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "go"
brew "lazygit"
brew "makensis"
brew "neovim"
brew "nvm"
brew "php"
brew "rbenv"
brew "rbenv-bundler"
brew "ripgrep"
brew "rust"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "amethyst"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "parallels"
cask "raycast"
cask "shottr"
cask "stats"
cask "visual-studio-code"
