tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "php", restart_service: true
brew "composer"
brew "dotnet"
brew "exa"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "go"
brew "lazygit"
brew "makensis"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "rbenv"
brew "rbenv-bundler"
brew "ripgrep"
brew "rust"
brew "watchman"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "amethyst"
cask "cleanmymac"
cask "discord"
cask "docker"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "jetbrains-toolbox"
cask "parallels"
cask "raycast"
cask "shottr"
cask "stats"
cask "visual-studio-code"
vscode "alefragnani.Bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "kokororin.vscode-phpfmt"
vscode "kreativ-software.csharpextensions"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "patbenatar.advanced-new-file"
vscode "patcx.vscode-nuget-gallery"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "rubenverg.bootstrap-product-icons"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "VSpaceCode.whichkey"
vscode "WallabyJs.quokka-vscode"
vscode "xdebug.php-debug"
